{
    "principles": [
        {
            "id": "WCAG2:perceivable",
            "num": "1",
            "handle": "Wahrnehmbar",
            "text": "Informationen und Bestandteile der Benutzerschnittstelle müssen den Benutzern so präsentiert werden, dass diese sie wahrnehmen können.",
            "guidelines": [
                {
                    "id": "WCAG2:text-equiv",
                    "num": "1.1",
                    "handle": "Textalternativen",
                    "text": "Stellen Sie Textalternativen für alle Nicht-Text-Inhalte zur Verfügung, so dass diese in andere vom Benutzer benötigte Formen geändert werden können, wie zum Beispiel Großschrift, Braille, Symbole oder einfachere Sprache.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:text-equiv-all",
                            "num": "1.1.1",
                            "handle": "Nicht-Text-Inhalt",
                            "text": "Alle Nicht-Text-Inhalte, die dem Benutzer präsentiert werden, haben eine Textalternative, die einem äquivalenten Zweck dient, mit Ausnahme der unten aufgelisteten Situationen.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Steuerelemente, Eingabe",
                                            "text": "Wenn es sich bei dem Nicht-Text-Inhalt um ein Steuerelement handelt oder Eingaben durch den Benutzer akzeptiert, dann hat dieser einen Namen, der seinen Zweck beschreibt. (Beachten Sie Richtlinie 4.1.2 für zusätzliche Anforderungen an Steuerelemente und Inhalte, die Eingaben durch den Benutzer akzeptieren.)"
                                        },
                                        {
                                            "handle": "Zeitbasierte Medien",
                                            "text": "Wenn es sich bei den Nicht-Text-Inhalten um zeitbasierte Medien handelt, dann stellen Textalternativen zumindest eine deskriptive Identifizierung des Nicht-Text-Inhalts bereit. (Beachten Sie Richtlinie 1.2 für zusätzliche Anforderungen an Medien.)"
                                        },
                                        {
                                            "handle": "Test",
                                            "text": "Wenn es sich bei dem Nicht-Text-Inhalt um einen Test oder eine Übung handelt, die nichtig wäre, wenn sie als Text dargestellt würde, dann stellen Textalternativen zumindest eine deskriptive Identifizierung des Nicht-Text-Inhalts bereit."
                                        },
                                        {
                                            "handle": "Sensorisch",
                                            "text": "Wenn Nicht-Text-Inhalt hauptsächlich dafür gedacht ist, eine bestimmte Sinneserfahrung zu schaffen, dann stellen Textalternativen zumindest eine deskriptive Identifizierung des Nicht-Text-Inhalts bereit."
                                        },
                                        {
                                            "handle": "CAPTCHA",
                                            "text": "Wenn der Zweck des Nicht-Text-Inhalts der ist zu bestätigen, dass eine Person und nicht ein Computer auf den Inhalt zugreift, dann werden Textalternativen bereitgestellt, die den Zweck des Nicht-Text-Inhalts identifizieren. Außerdem werden alternative Formen von CAPTCHAs bereitgestellt, die Ausgabeformen für verschiedene Arten der sensorischen Wahrnehmung nutzen, um verschiedenen Behinderungen Rechnung zu tragen."
                                        },
                                        {
                                            "handle": "Dekoration, Formatierung, unsichtbar",
                                            "text": "Wenn der Nicht-Text-Inhalt reine Dekoration ist, nur für visuelle Formatierung benutzt wird oder dem Benutzer gar nicht präsentiert wird, dann wird der Inhalt so implementiert, dass er von assistierender Technik ignoriert werden kann."
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "WCAG2:media-equiv",
                    "num": "1.2",
                    "handle": "Zeitbasierte Medien",
                    "text": "Stellen Sie Alternativen für zeitbasierte Medien zur Verfügung.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:media-equiv-av-only-alt",
                            "num": "1.2.1",
                            "handle": "Reine Audio- und Videoinhalte (aufgezeichnet)",
                            "text": "Für aufgezeichnete reine Audio- und aufgezeichnete reine Video- Medien gilt das Folgende, außer die Audio- oder Videomedien sind eine Medienalternative für Text und als solche klar gekennzeichnet:",
                            "level": "A",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Aufgezeichneter reiner Audioinhalt",
                                            "text": "Es wird eine Alternative für zeitbasierte Medien bereitgestellt, die äquivalente Informationen für aufgezeichneten reinen Audioinhalt bietet."
                                        },
                                        {
                                            "handle": "Aufgezeichneter reiner Videoinhalt",
                                            "text": "Es wird entweder eine Alternative für zeitbasierte Medien oder eine Audiospur zur Verfügung gestellt, die äquivalente Informationen für aufgezeichneten reinen Videoinhalt bietet."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:media-equiv-captions",
                            "num": "1.2.2",
                            "handle": "Untertitel (aufgezeichnet)",
                            "text": "Untertitel werden für alle aufgezeichneten Audioinhalte in synchronisierten Medien bereitgestellt, außer die Medien sind eine Medienalternative für Text und als solche deutlich gekennzeichnet.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:media-equiv-audio-desc",
                            "num": "1.2.3",
                            "handle": "Audiodeskription oder Medienalternative (aufgezeichnet)",
                            "text": "Eine Alternative für zeitbasierte Medien oder eine Audiodeskription des aufgezeichneten Videoinhalts wird für synchronisierte Medien bereitgestellt, außer die Medien sind eine Medienalternative für Text und als solche deutlich gekennzeichnet.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:media-equiv-real-time-captions",
                            "num": "1.2.4",
                            "handle": "Untertitel (Live)",
                            "text": "Untertitel werden für alle Live- Audioinhalte in synchronisierten Medien bereitgestellt.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:media-equiv-audio-desc-only",
                            "num": "1.2.5",
                            "handle": "Audiodeskription (aufgezeichnet)",
                            "text": "Eine Audiodeskription wird für alle aufgezeichneten Videoinhalte in synchronisierten Medien zur Verfügung gestellt.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:media-equiv-sign",
                            "num": "1.2.6",
                            "handle": "Gebärdensprache (aufgezeichnet)",
                            "text": "Eine Übersetzung in die Gebärdensprache wird für alle aufgezeichneten Audioinhalte in synchronisierten Medien bereitgestellt.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:media-equiv-extended-ad",
                            "num": "1.2.7",
                            "handle": "Erweiterte Audiodeskription (aufgezeichnet)",
                            "text": "Wenn die Pausen im Vordergrund-Audio nicht ausreichend sind, um Audiodeskriptionen zu ermöglichen, die den Sinn des Videos vermitteln, dann wird eine erweiterte Audiodeskription für alle aufgezeichneten Videoinhalte in synchronisierten Medien bereitgestellt.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:media-equiv-text-doc",
                            "num": "1.2.8",
                            "handle": "Medienalternative (aufgezeichnet)",
                            "text": "Eine Alternative für zeitbasierte Medien wird für alle aufgezeichneten synchronisierten Medien und für alle aufgezeichneten reinen Videomedien bereitgestellt.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:media-equiv-live-audio-only",
                            "num": "1.2.9",
                            "handle": "Reiner Audioinhalt (Live)",
                            "text": "Eine Alternative für zeitbasierte Medien, die äquivalente Informationen für live übertragene reine Audioinhalte bietet, wird bereitgestellt.",
                            "level": "AAA"
                        }
                    ]
                },
                {
                    "id": "WCAG2:content-structure-separation",
                    "num": "1.3",
                    "handle": "Anpassbar",
                    "text": "Erstellen Sie Inhalte, die auf verschiedene Arten dargestellt werden können (z.B. einfacheres Layout), ohne dass Informationen oder Struktur verloren gehen.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:content-structure-separation-programmatic",
                            "num": "1.3.1",
                            "handle": "Info und Beziehungen",
                            "text": "Informationen, Struktur und Beziehungen, die über die Darstellung vermittelt werden, können durch Software bestimmt werden oder stehen in Textform zur Verfügung.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:content-structure-separation-sequence",
                            "num": "1.3.2",
                            "handle": "Bedeutungstragende Reihenfolge",
                            "text": "Wenn die Reihenfolge, in der Inhalte präsentiert werden, sich auf deren Bedeutung auswirkt, kann die korrekte Leseabfolge durch Software bestimmt werden.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:content-structure-separation-understanding",
                            "num": "1.3.3",
                            "handle": "Sensorische Eigenschaften",
                            "text": "Anweisungen, die für das Verständnis und die Bedienung von Inhalt bereitgestellt werden, stützen sich nicht nur auf sensorische Eigenschaften von Komponenten wie Form, Größe, visuelle Position, Ausrichtung oder Ton.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Anmerkung",
                                    "text": "Für Anforderungen in Bezug auf Farbe beachten Sie Richtlinie 1.4."
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "WCAG2:visual-audio-contrast",
                    "num": "1.4",
                    "handle": "Unterscheidbar",
                    "text": "Machen Sie es Benutzern leichter, Inhalt zu sehen und zu hören einschließlich der Trennung von Vorder- und Hintergrund.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:visual-audio-contrast-without-color",
                            "num": "1.4.1",
                            "handle": "Benutzung von Farbe",
                            "text": "Farbe wird nicht als einziges visuelles Mittel benutzt, um Informationen zu vermitteln, eine Handlung zu kennzeichnen, eine Reaktion zu veranlassen oder ein visuelles Element zu unterscheiden.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Anmerkung",
                                    "text": "Dieses Erfolgskriterium spricht ausdrücklich die Farbwahrnehmung an. Andere Formen der Wahrnehmung werden in Richtlinie 1.3 behandelt einschließlich programmtechnischer Zugriff auf Farbe und andere visuelle Darstellungskodierungen."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-dis-audio",
                            "num": "1.4.2",
                            "handle": "Audio-Steuerelement",
                            "text": "Wenn Audioinhalt auf einer Webseite automatisch für mehr als 3 Sekunden abgespielt wird, dann gibt es entweder einen Mechanismus, um die Wiedergabe zu pausieren oder zu beenden, oder es gibt einen Mechanismus, um die Lautstärke unabhängig von der allgemeinen Systemlautstärke zu regeln.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Anmerkung",
                                    "text": "Jeglicher Inhalt, der dieses Erfolgskriterium nicht erfüllt, kann die Möglichkeit eines Benutzers beeinträchtigen, die ganze Seite zu nutzen. Daher muss jeglicher Inhalt auf einer Webseite (egal ob er dazu benutzt wird, andere Erfolgskriterien zu erfüllen oder nicht) dieses Erfolgskriterium erfüllen. Siehe Konformitätsbedingung 5: Nicht störend."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-contrast",
                            "num": "1.4.3",
                            "handle": "Kontrast (Minimum)",
                            "text": "Die visuelle Darstellung von Text und Bildern von Text hat ein Kontrastverhältnis von mindestens 4,5:1 mit folgenden Ausnahmen:",
                            "level": "AA",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Großer Text",
                                            "text": "Großer Text und Bilder von großem Text haben ein Kontrastverhältnis von mindestens 3:1;"
                                        },
                                        {
                                            "handle": "Nebensächlich",
                                            "text": "Für Text oder Bilder eines Textes, die Teil eines inaktiven Bestandteils der Benutzerschnittstelle, rein dekorativ, für niemanden sichtbar oder Teil eines Bildes sind, welches signifikanten anderen visuellen Inhalt enthält, gibt es keine Kontrastanforderung."
                                        },
                                        {
                                            "handle": "Wortbildmarken",
                                            "text": "Text, der Teil eines Logos oder eines Markennamens ist, hat keine Kontrastanforderungen."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-scale",
                            "num": "1.4.4",
                            "handle": "Textgröße ändern",
                            "text": "Mit Ausnahme von Untertiteln und Bildern eines Textes, kann Text ohne assistierende Technik um bis zu 200 Prozent geändert werden, ohne dass dabei Inhalt oder Funktionalität verloren geht.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-text-presentation",
                            "num": "1.4.5",
                            "handle": "Bilder eines Textes",
                            "text": "Wenn die benutzten Techniken die visuelle Präsentation bewirken können, dann wird Text statt Bilder eines Textes dazu benutzt, Informationen zu vermitteln mit den folgenden Ausnahmen:",
                            "level": "AA",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Anpassbar",
                                            "text": "Das Bild eines Textes kann visuell an die Anforderungen des Benutzers angepasst werden;"
                                        },
                                        {
                                            "handle": "Unentbehrlich",
                                            "text": "Eine bestimmte Präsentation von Text ist für die vermittelten Informationen unentbehrlich."
                                        }
                                    ]
                                },
                                {
                                    "type": "note",
                                    "handle": "Anmerkung",
                                    "text": "Wortbildmarken (Text, der Teil eines Logos oder Markennamens ist) werden als unentbehrlich betrachtet."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast7",
                            "num": "1.4.6",
                            "handle": "Kontrast (erhöht)",
                            "text": "Die visuelle Präsentation von Text und Bildern eines Textes hat ein Kontrastverhältnis von mindestens 7:1, mit folgenden Ausnahmen:",
                            "level": "AAA",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Großer Text",
                                            "text": "Großer Text und Bilder von großem Text haben ein Kontrastverhältnis von mindestens 4,5:1;"
                                        },
                                        {
                                            "handle": "Nebensächlich",
                                            "text": "Für Text oder Bilder eines Textes, die Teil eines inaktiven Bestandteils der Benutzerschnittstelle, rein dekorativ, für niemanden sichtbar oder Teil eines Bildes sind, welches signifikanten anderen visuellen Inhalt enthält, gibt es keine Kontrastanforderung."
                                        },
                                        {
                                            "handle": "Wortbildmarken",
                                            "text": "Text, der Teil eines Logos oder eines Markennamens ist, hat keine Mindest-Kontrastanforderungen."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-noaudio",
                            "num": "1.4.7",
                            "handle": "Leiser oder kein Hintergrund-Audioinhalt",
                            "text": "Für aufgezeichneten, reinen Audioinhalt, der (1) hauptsächlich Sprache im Vordergrund enthält, (2) kein Audio-CAPTCHA oder ein Audio-Logo ist und (3) bei dem es sich nicht um eine Vokalisierung handelt, die hauptsächlich als musikalischer Ausdruck bestimmt ist wie beispielsweise Singen oder Rappen, gilt mindestens eines der Folgenden:",
                            "level": "AAA",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Kein Hintergrund",
                                            "text": "Der Audioinhalt enthält keine Hintergrundgeräusche."
                                        },
                                        {
                                            "handle": "Abschalten",
                                            "text": "Die Hintergrundgeräusche können abgeschaltet werden."
                                        },
                                        {
                                            "handle": "20 dB",
                                            "text": "Die Hintergrundgeräusche sind mindestens 20 Dezibel leiser als der Sprachinhalt im Vordergrund mit der Ausnahme von gelegentlichen Geräuschen, die nur 1 oder 2 Sekunden andauern. Anmerkung: Gemäß der Definition von „Dezibel“ sind Hintergrundgeräusche, die diese Anforderung erfüllen, ungefähr viermal so leise wie der Sprachinhalt im Vordergrund."
                                        }
                                    ]
                                },
                                {
                                    "type": "note",
                                    "handle": "Anmerkung",
                                    "text": "Gemäß der Definition von „Dezibel“ sind Hintergrundgeräusche, die diese Anforderung erfüllen, ungefähr viermal so leise wie der Sprachinhalt im Vordergrund."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-visual-presentation",
                            "num": "1.4.8",
                            "handle": "Visuelle Präsentation",
                            "text": "Für die visuelle Präsentation von Textblöcken gibt es einen Mechanismus, um das Folgende zu erreichen:",
                            "level": "AAA",
                            "details": [
                                {
                                    "type": "olist",
                                    "items": [
                                        {
                                            "handle": "",
                                            "text": "Vorder- und Hintergrundfarben können vom Benutzer ausgewählt werden."
                                        },
                                        {
                                            "handle": "",
                                            "text": "Die Breite beträgt nicht mehr als 80 Zeichen oder Glyphen (40 wenn es sich um CJK handelt)."
                                        },
                                        {
                                            "handle": "",
                                            "text": "Text ist nicht im Blocksatz ausgerichtet (sowohl links- als auch rechtsbündig ausgerichtet)."
                                        },
                                        {
                                            "handle": "",
                                            "text": "Der Zeilenabstand (Durchschuss) ist mindestens 1,5-fach innerhalb von Paragraphen und der Paragraphenabstand ist mindestens 1,5-fach so groß wie der Zeilenabstand."
                                        },
                                        {
                                            "handle": "",
                                            "text": "Die Textgröße kann ohne assistierende Technik bis auf 200 Prozent skaliert werden und zwar so, dass der Leser nicht horizontal scrollen muss, um eine Textzeile in einem bildschirmfüllenden Fenster zu lesen."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:visual-audio-contrast-text-images",
                            "num": "1.4.9",
                            "handle": "Bilder eines Textes (keine Ausnahme)",
                            "text": "Bilder eines Textes werden nur rein dekorativ benutzt oder dann, wenn eine bestimmte Präsentation von Text unentbehrlich für die zu vermittelnden Informationen ist.",
                            "level": "AAA",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Anmerkung",
                                    "text": "Wortbildmarken (Text, der Teil eines Logos oder Markennamens ist) werden als unentbehrlich betrachtet."
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "WCAG2:operable",
            "num": "2",
            "handle": "Bedienbar",
            "text": "Bestandteile der Benutzerschnittstelle und Navigation müssen bedienbar sein.",
            "guidelines": [
                {
                    "id": "WCAG2:keyboard-operation",
                    "num": "2.1",
                    "handle": "Per Tastatur zugänglich",
                    "text": "Sorgen Sie dafür, dass alle Funktionalitäten per Tastatur zugänglich sind.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:keyboard-operation-keyboard-operable",
                            "num": "2.1.1",
                            "handle": "Tastatur",
                            "text": "Alle Funktionalitäten des Inhalts sind durch eine Tastaturschnittstelle bedienbar, ohne dass eine bestimmte Zeiteinteilung für einzelne Tastenanschläge erforderlich ist, außer wenn die zugrunde liegende Funktion Eingaben verlangt, die vom Pfad der Bewegung des Benutzers und nicht nur von den Endpunkten abhängig sind.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Anmerkung 1",
                                    "text": "Diese Ausnahme bezieht sich auf die zugrunde liegende Funktion und nicht auf die Eingabetechnik. Zum Beispiel: Wenn man Handschrift benutzt, um Text einzugeben, dann verlangt die Eingabetechnik (Handschrift) Pfad-abhängige Eingaben, die zugrunde liegende Funktion (Texteingabe) verlangt dies aber nicht."
                                },
                                {
                                    "type": "note",
                                    "handle": "Anmerkung 2",
                                    "text": "Es ist nicht verboten noch sollte es Sie davon abhalten, eine Maus-Eingabe oder andere Eingabemethoden zusätzlich zur Tastaturbedienung zur Verfügung zu stellen."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:keyboard-operation-trapping",
                            "num": "2.1.2",
                            "handle": "Keine Tastaturfalle",
                            "text": "Wenn der Tastaturfokus durch eine Tastaturschnittstelle auf einen Bestandteil der Seite bewegt werden kann, dann kann der Fokus von diesem Bestandteil weg bewegt werden, indem man nur die Tastaturschnittstelle benutzt; wenn man dazu mehr als nicht modifizierte Pfeil- oder Tabulatortasten oder andere übliche Ausstiegsmethoden benutzen muss, dann wird der Benutzer über die Methode zum Bewegen des Fokus informiert.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Anmerkung",
                                    "text": "Jeglicher Inhalt, der dieses Erfolgskriterium nicht erfüllt, kann die Möglichkeit eines Benutzers beeinträchtigen, die ganze Seite zu nutzen. Daher muss jeglicher Inhalt auf einer Webseite (egal ob er dazu benutzt wird, andere Erfolgskriterien zu erfüllen oder nicht) dieses Erfolgskriterium erfüllen. Siehe Konformitätsbedingung 5: Nicht-Störend."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:keyboard-operation-all-funcs",
                            "num": "2.1.3",
                            "handle": "Tastatur (keine Ausnahme)",
                            "text": "Alle Funktionalitäten des Inhalts sind durch eine Tastaturschnittstelle bedienbar, ohne dass eine bestimmte Zeiteinteilung für einzelne Tastenanschläge erforderlich ist.",
                            "level": "AAA"
                        }
                    ]
                },
                {
                    "id": "WCAG2:time-limits",
                    "num": "2.2",
                    "handle": "Ausreichend Zeit",
                    "text": "Geben Sie den Benutzern ausreichend Zeit, Inhalte zu lesen und zu benutzen.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:time-limits-required-behaviors",
                            "num": "2.2.1",
                            "handle": "Zeiteinteilung anpassbar",
                            "text": "Für jede zeitliche Begrenzung, die vom Inhalt festgelegt wird, gilt mindestens eines der Folgenden:",
                            "level": "A",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Abschalten",
                                            "text": "Der Benutzer kann die zeitliche Begrenzung abschalten, bevor er darauf trifft oder"
                                        },
                                        {
                                            "handle": "Anpassen",
                                            "text": "Der Benutzer darf die zeitliche Begrenzung anpassen, bevor er darauf trifft, und zwar so weitreichend, dass es sich um die mindestens zehnfache Zeit der Standardeinstellung handelt oder"
                                        },
                                        {
                                            "handle": "Ausweiten",
                                            "text": "Der Benutzer wird gewarnt, bevor die Zeit abläuft und bekommt mindestens 20 Sekunden Zeit, um die zeitliche Begrenzung mit einer einfachen Handlung auszuweiten (zum Beispiel: „Drücken Sie die Leertaste“) und der Benutzer darf die zeitliche Begrenzung mindestens 10 mal ausweiten oder"
                                        },
                                        {
                                            "handle": "Echtzeit-Ausnahme",
                                            "text": "Die zeitliche Begrenzung ist ein erforderlicher Bestandteil eines Echtzeit-Ereignisses (zum Beispiel einer Auktion) und es gibt keine Alternative zur zeitlichen Begrenzung oder"
                                        },
                                        {
                                            "handle": "Unentbehrliche Ausnahme",
                                            "text": "Die zeitliche Begrenzung ist unentbehrlich und eine Ausweitung dieser würde die Handlung ungültig machen oder"
                                        },
                                        {
                                            "handle": "20 Stunden-Ausnahme",
                                            "text": "Die zeitliche Begrenzung beträgt mehr als 20 Stunden."
                                        }
                                    ]
                                },
                                {
                                    "type": "note",
                                    "handle": "Anmerkung",
                                    "text": "Dieses Erfolgskriterium hilft dabei sicherzustellen, dass Benutzer Aufgaben beenden können ohne unerwartete Änderungen am Inhalt oder Gesamtzusammenhang, die das Ergebnis einer zeitlichen Begrenzung sind. Dieses Erfolgskriterium sollte zusammen mit Erfolgskriterium 3.2.1 betrachtet werden, welches Änderungen am Inhalt oder am Gesamtzusammenhang als Ergebnis von Benutzerhandlungen begrenzt."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:time-limits-pause",
                            "num": "2.2.2",
                            "handle": "Pausieren, beenden, ausblenden",
                            "text": "Für sich bewegende, blinkende, scrollende oder sich automatisch aktualisierende Informationen gelten alle folgenden Punkte:",
                            "level": "A",
                            "details": [
                                {
                                    "type": "ulist",
                                    "items": [
                                        {
                                            "handle": "Sich bewegend, blinkend, scrollend",
                                            "text": "Für alle sich bewegenden, blinkenden oder scrollenden Informationen, die (1) automatisch beginnen, (2) länger als 5 Sekunden dauern und (3) parallel zu anderen Inhalten dargestellt werden, gibt es einen Mechanismus für den Benutzer, um diese zu pausieren, zu beenden oder auszublenden außer die Bewegung, das Blinken oder das Scrollen ist Teil einer Handlung, bei der es unentbehrlich ist und"
                                        },
                                        {
                                            "handle": "Automatische Aktualisierung",
                                            "text": "Für alle sich automatisch aktualisierenden Informationen, die (1) automatisch beginnen und (2) parallel mit anderen Inhalten dargestellt werden, gibt es einen Mechanismus, damit der Benutzer die Aktualisierung pausieren, beenden oder ausblenden oder die Häufigkeit der Aktualisierung kontrollieren kann, außer die automatische Aktualisierung ist Teil einer Handlung, bei der sie unentbehrlich ist."
                                        }
                                    ]
                                },
                                {
                                    "type": "note",
                                    "handle": "Anmerkung 1",
                                    "text": "Für Anforderungen in Bezug auf flackernden oder blitzenden Inhalt beachten Sie Richtlinie 2.3."
                                },
                                {
                                    "type": "note",
                                    "handle": "Anmerkung 2",
                                    "text": "Jeglicher Inhalt, der dieses Erfolgskriterium nicht erfüllt, kann die Möglichkeit eines Benutzers beeinträchtigen, die ganze Seite zu nutzen. Daher muss jeglicher Inhalt auf einer Webseite (egal ob er dazu benutzt wird, andere Erfolgskriterien zu erfüllen oder nicht) dieses Erfolgskriterium erfüllen. Siehe Konformitätsbedingung 5: Nicht-Störend."
                                },
                                {
                                    "type": "note",
                                    "handle": "Anmerkung 3",
                                    "text": "Inhalt, der regelmäßig durch Software aktualisiert oder zum Benutzeragenten gestreamt wird, muss Informationen, die zwischen dem Beginn der Pause und der Wiederaufnahme der Präsentation generiert oder erhalten werden, nicht aufrechterhalten oder anzeigen, da dies möglicherweise technisch nicht möglich ist und es in vielen Situationen irreführend sein könnte, dies zu tun."
                                },
                                {
                                    "type": "note",
                                    "handle": "Anmerkung 4",
                                    "text": "Eine Animation, die als Teil einer Vorlade-Phase oder einer ähnlichen Situation entsteht, kann als unentbehrlich angesehen werden, wenn für alle Benutzer während dieser Phase keine Interaktion stattfinden kann und wenn es Benutzer verwirren könnte oder dazu führen könnte, dass sie denken, dass der Inhalt eingefroren oder defekt ist, wenn der Fortschritt nicht angezeigt wird."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:time-limits-no-exceptions",
                            "num": "2.2.3",
                            "handle": "Keine Zeiteinteilung",
                            "text": "Die Zeiteinteilung ist kein unentbehrlicher Teil eines vom Inhalt dargestellten Ereignisses oder einer Handlung außer bei nicht-interaktiven synchronisierten Medien und Echtzeit-Ereignissen.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:time-limits-postponed",
                            "num": "2.2.4",
                            "handle": "Unterbrechungen",
                            "text": "Unterbrechungen können vom Benutzer aufgeschoben oder unterdrückt werden mit Ausnahme von Unterbrechungen, bei denen es sich um einen Notfall handelt.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:time-limits-server-timeout",
                            "num": "2.2.5",
                            "handle": "Erneute Authentifizierung",
                            "text": "Wenn eine authentifizierte Sitzung abläuft, kann der Benutzer die Handlung nach der erneuten Authentifizierung ohne Datenverlust fortführen.",
                            "level": "AAA"
                        }
                    ]
                },
                {
                    "id": "WCAG2:seizure",
                    "num": "2.3",
                    "handle": "Anfälle",
                    "text": "Gestalten Sie Inhalte nicht auf Arten, von denen bekannt ist, dass sie zu Anfällen führen.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:seizure-does-not-violate",
                            "num": "2.3.1",
                            "handle": "Grenzwert von dreimaligem Blitzen oder weniger",
                            "text": "Webseiten enthalten nichts, was öfter als dreimal in einem beliebigen, eine Sekunde dauernden Zeitraum blitzt, oder der Blitz ist unterhalb der allgemeinen Grenzwerte zu Blitzen und roten Blitzen.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Anmerkung",
                                    "text": "Jeglicher Inhalt, der dieses Erfolgskriterium nicht erfüllt, kann die Möglichkeit eines Benutzers beeinträchtigen, die ganze Seite zu nutzen. Daher muss jeglicher Inhalt auf einer Webseite (egal ob er dazu benutzt wird, andere Erfolgskriterien zu erfüllen oder nicht) dieses Erfolgskriterium erfüllen. Siehe Konformitätsbedingung 5: Nicht-Störend."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:seizure-three-times",
                            "num": "2.3.2",
                            "handle": "Drei Blitze",
                            "text": "Webseiten enthalten nichts, das öfter als dreimal in einem beliebigen, eine Sekunde dauernden Zeitraum blitzt.",
                            "level": "AAA"
                        }
                    ]
                },
                {
                    "id": "WCAG2:navigation-mechanisms",
                    "num": "2.4",
                    "handle": "Navigierbar",
                    "text": "Stellen Sie Mittel zur Verfügung, um Benutzer dabei zu unterstützen zu navigieren, Inhalte zu finden und zu bestimmen, wo sie sich befinden.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:navigation-mechanisms-skip",
                            "num": "2.4.1",
                            "handle": "Blöcke umgehen",
                            "text": "Es gibt einen Mechanismus, um Inhaltsblöcke zu umgehen, die auf verschiedenen Webseiten wiederholt werden.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-title",
                            "num": "2.4.2",
                            "handle": "Seite mit Titel versehen",
                            "text": "Webseiten haben einen Titel, der Thema oder Zweck beschreibt.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-focus-order",
                            "num": "2.4.3",
                            "handle": "Fokus-Reihenfolge",
                            "text": "Wenn eine Webseite der Reihe nach navigiert werden kann und die Reihenfolge der Navigation die Bedeutung oder Bedienung beeinflusst, erhalten fokussierbare Komponenten den Fokus in einer Reihenfolge, der Bedeutung und Bedienbarkeit aufrecht erhält.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-refs",
                            "num": "2.4.4",
                            "handle": "Linkzweck (im Kontext)",
                            "text": "Der Zweck jedes Links kann durch den Linktext allein oder durch den Linktext zusammen mit seinem durch Software bestimmten Link-Kontext bestimmt werden außer in Fällen, in denen der Zweck des Links mehrdeutig für Benutzer im Allgemeinen wäre.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-mult-loc",
                            "num": "2.4.5",
                            "handle": "Verschiedene Methoden",
                            "text": "Es gibt mehr als eine Methode, um eine Webseite innerhalb eines Satzes von Webseiten zu finden, außer die Webseite ist das Ergebnis oder ein Schritt innerhalb eines Prozesses.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-descriptive",
                            "num": "2.4.6",
                            "handle": "Überschriften und Beschriftungen (Labels)",
                            "text": "Überschriften und Labels beschreiben ein Thema oder einen Zweck.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-focus-visible",
                            "num": "2.4.7",
                            "handle": "Fokus sichtbar",
                            "text": "Jede durch Tastatur bedienbare Benutzerschnittstelle hat einen Bedienmodus, bei dem der Tastaturfokus sichtbar ist.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-location",
                            "num": "2.4.8",
                            "handle": "Position",
                            "text": "Es gibt Informationen zu der Position des Benutzers innerhalb eines Satzes von Webseiten.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-link",
                            "num": "2.4.9",
                            "handle": "Linkzweck (reiner Link)",
                            "text": "Es gibt einen Mechanismus, um den Zweck jedes Links durch den Linktext allein zu erkennen, außer der Linkzweck wäre mehrdeutig für Benutzer im Allgemeinen.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:navigation-mechanisms-headings",
                            "num": "2.4.10",
                            "handle": "Abschnittsüberschriften",
                            "text": "Abschnittsüberschriften werden genutzt, um den Inhalt zu gliedern.",
                            "level": "AAA",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Anmerkung 1",
                                    "text": "„Überschrift“ wird in seiner allgemeinen Bedeutung benutzt und beinhaltet Titel und andere Methoden, um verschiedenen Arten von Inhalt eine Überschrift hinzuzufügen."
                                },
                                {
                                    "type": "note",
                                    "handle": "Anmerkung 2",
                                    "text": "Dieses Erfolgskriterium behandelt Abschnitte innerhalb von Geschriebenem, nicht Bestandteile der Benutzerschnittstelle. Bestandteile der Benutzerschnittstelle werden unter Erfolgskriterium 4.1.2 behandelt."
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "WCAG2:understandable",
            "num": "3",
            "handle": "Verständlich",
            "text": "Informationen und Bedienung der Benutzerschnittstelle müssen verständlich sein.",
            "guidelines": [
                {
                    "id": "WCAG2:meaning",
                    "num": "3.1",
                    "handle": "Lesbar",
                    "text": "Machen Sie Inhalt lesbar und verständlich.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:meaning-doc-lang-id",
                            "num": "3.1.1",
                            "handle": "Sprache der Seite",
                            "text": "Die voreingestellte menschliche Sprache jeder Webseite kann durch Software bestimmt werden.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:meaning-other-lang-id",
                            "num": "3.1.2",
                            "handle": "Sprache von Teilen",
                            "text": "Die menschliche Sprache jedes Abschnitts oder jedes Satzes im Inhalt kann durch Software bestimmt werden außer bei Eigennamen, technischen Fachbegriffen, Wörtern einer unklaren Sprache und Wörtern oder Wendungen, die Teil des Jargons des direkt umliegenden Textes geworden sind.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:meaning-idioms",
                            "num": "3.1.3",
                            "handle": "Ungewöhnliche Wörter",
                            "text": "Es gibt einen Mechanismus, um spezielle Definitionen von Wörtern oder Wendungen zu erkennen, die auf ungewöhnliche oder eingeschränkte Weise benutzt werden, Idiome und Jargon eingeschlossen.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:meaning-located",
                            "num": "3.1.4",
                            "handle": "Abkürzungen",
                            "text": "Es gibt einen Mechanismus, um die ausgeschriebene Form oder Bedeutung von Abkürzungen zu erkennen.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:meaning-supplements",
                            "num": "3.1.5",
                            "handle": "Leseniveau",
                            "text": "Wenn der Text nach der Entfernung von Eigennamen und Titeln Lesefähigkeiten voraussetzt, die über das Niveau der niedrigen, sekundären Schulbildung hinausgehen, dann gibt es ergänzenden Inhalt oder eine Version, die keine über die niedrige, sekundäre Schulbildung hinausgehenden Lesefähigkeiten verlangt.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:meaning-pronunciation",
                            "num": "3.1.6",
                            "handle": "Aussprache",
                            "text": "Es gibt einen Mechanismus, um die bestimmte Aussprache von Wörtern zu erkennen, wenn die Bedeutung der Wörter - im Zusammenhang - mehrdeutig ist, wenn man die Aussprache nicht kennt.",
                            "level": "AAA"
                        }
                    ]
                },
                {
                    "id": "WCAG2:consistent-behavior",
                    "num": "3.2",
                    "handle": "Vorhersehbar",
                    "text": "Sorgen Sie dafür, dass Webseiten vorhersehbar aussehen und funktionieren.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:consistent-behavior-receive-focus",
                            "num": "3.2.1",
                            "handle": "Bei Fokus",
                            "text": "Wenn irgendein Bestandteil den Fokus erhält, dann löst dies nicht eine Änderung des Kontextes aus.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:consistent-behavior-unpredictable-change",
                            "num": "3.2.2",
                            "handle": "Bei Eingabe",
                            "text": "Die Änderung der Einstellung irgendeines Bestandteils der Benutzerschnittstelle führt nicht automatisch zur Änderung des Kontextes, außer der Benutzer wurde vor Benutzung des Bestandteils auf das Verhalten hingewiesen.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:consistent-behavior-consistent-locations",
                            "num": "3.2.3",
                            "handle": "Konsistente Navigation",
                            "text": "Navigationsmechanismen, die auf mehreren Webseiten innerhalb eines Satzes von Webseiten wiederholt werden, treten jedes Mal, wenn sie wiederholt werden, in der gleichen relativen Reihenfolge auf, außer eine Änderung wird durch den Benutzer ausgelöst.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:consistent-behavior-consistent-functionality",
                            "num": "3.2.4",
                            "handle": "Konsistente Erkennung",
                            "text": "Bestandteile mit der gleichen Funktionalität innerhalb eines Satzes von Webseiten werden konsistent erkannt.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:consistent-behavior-no-extreme-changes-context",
                            "num": "3.2.5",
                            "handle": "Änderung auf Anfrage",
                            "text": "Änderungen des Kontextes werden nur durch Benutzeranfrage ausgelöst oder es gibt einen Mechanismus, um solche Änderungen abzuschalten.",
                            "level": "AAA"
                        }
                    ]
                },
                {
                    "id": "WCAG2:minimize-error",
                    "num": "3.3",
                    "handle": "Hilfestellung bei der Eingabe",
                    "text": "Helfen Sie den Benutzern dabei, Fehler zu vermeiden und zu korrigieren.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:minimize-error-identified",
                            "num": "3.3.1",
                            "handle": "Fehlererkennung",
                            "text": "Wenn ein Eingabefehler automatisch erkannt wird, dann wird das fehlerhafte Element identifiziert und der Fehler wird dem Benutzer in Textform beschrieben.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:minimize-error-cues",
                            "num": "3.3.2",
                            "handle": "Beschriftungen (Labels) oder Anweisungen",
                            "text": "Wenn der Inhalt eine Eingabe durch den Benutzer verlangt werden Beschriftungen (Labels) oder Anweisungen bereitgestellt.",
                            "level": "A"
                        },
                        {
                            "id": "WCAG2:minimize-error-suggestions",
                            "num": "3.3.3",
                            "handle": "Fehlerempfehlung",
                            "text": "Wenn ein Eingabefehler automatisch erkannt wird und Korrekturempfehlungen bekannt sind, dann werden diese Empfehlungen dem Benutzer bereitgestellt, außer dies würde die Sicherheit oder den Zweck des Inhalts gefährden.",
                            "level": "AA"
                        },
                        {
                            "id": "WCAG2:minimize-error-reversible",
                            "num": "3.3.4",
                            "handle": "Fehlervermeidung (rechtliche, finanzielle, Daten)",
                            "text": "Für Webseiten, die eine für den Benutzer auftretende rechtliche Verpflichtung oder finanzielle Transaktion zur Folge haben, die Benutzer-gesteuerte Daten in Datenspeicherungssystemen ändern oder löschen oder die Testantworten des Benutzers abschicken, gilt mindestens eines der Folgenden:",
                            "level": "AA",
                            "details": [
                                {
                                    "type": "olist",
                                    "items": [
                                        {
                                            "handle": "Reversibel",
                                            "text": "Versendete Daten sind reversibel."
                                        },
                                        {
                                            "handle": "Geprüft",
                                            "text": "Vom Benutzer eingegebene Daten werden auf Eingabefehler überprüft und der Benutzer erhält die Gelegenheit, diese zu korrigieren."
                                        },
                                        {
                                            "handle": "Bestätigt",
                                            "text": "Es gibt einen Mechanismus, um Informationen zu überprüfen, zu bestätigen und zu korrigieren, bevor sie endgültig abgesendet werden."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:minimize-error-context-help",
                            "num": "3.3.5",
                            "handle": "Hilfe",
                            "text": "Es gibt eine kontextsensitive Hilfe.",
                            "level": "AAA"
                        },
                        {
                            "id": "WCAG2:minimize-error-reversible-all",
                            "num": "3.3.6",
                            "handle": "Fehlervermeidung (alle)",
                            "text": "Für Webseiten, die verlangen, dass der Benutzer Informationen absendet, gilt mindestens eines der Folgenden:",
                            "level": "AAA",
                            "details": [
                                {
                                    "type": "olist",
                                    "items": [
                                        {
                                            "handle": "Reversibel",
                                            "text": "Versendete Daten sind reversibel."
                                        },
                                        {
                                            "handle": "Geprüft",
                                            "text": "Vom Benutzer eingegebene Daten werden auf Eingabefehler überprüft und der Benutzer erhält die Gelegenheit, diese zu korrigieren."
                                        },
                                        {
                                            "handle": "Bestätigt",
                                            "text": "Es gibt einen Mechanismus, um Informationen zu überprüfen, zu bestätigen und zu korrigieren, bevor sie endgültig abgesendet werden."
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "WCAG2:robust",
            "num": "4",
            "handle": "Robust",
            "text": "Inhalte müssen robust genug sein, damit sie zuverlässig von einer großen Auswahl an Benutzeragenten einschließlich assistierender Techniken interpretiert werden können.",
            "guidelines": [
                {
                    "id": "WCAG2:ensure-compat",
                    "num": "4.1",
                    "handle": "Kompatibel",
                    "text": "Maximieren Sie die Kompatibilität mit aktuellen und zukünftigen Benutzeragenten, einschließlich assistierender Techniken.",
                    "successcriteria": [
                        {
                            "id": "WCAG2:ensure-compat-parses",
                            "num": "4.1.1",
                            "handle": "Syntaxanalyse",
                            "text": "Bei Inhalt, der durch die Benutzung von Auszeichnungssprache implementiert wurde, haben Elemente komplette Start- und End-Tags, werden Elemente entsprechend ihrer Spezifikationen verschachtelt, enthalten Elemente keine doppelten Attribute und alle IDs sind einzigartig, außer wenn die Spezifikationen diese Eigenschaften erlauben.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Anmerkung",
                                    "text": "Start- und End-Tags, bei denen entscheidende Zeichen in ihrer Formation fehlen, wie eine schließende spitze Klammer oder nicht zueinander passende Anführungszeichen von Attribut-Werten, sind nicht vollständig."
                                }
                            ]
                        },
                        {
                            "id": "WCAG2:ensure-compat-rsv",
                            "num": "4.1.2",
                            "handle": "Name, Rolle, Wert",
                            "text": "Für alle Bestandteile der Benutzerschnittstelle (einschließlich, aber nicht beschränkt auf: Formularelemente, Links und durch Skripte generierte Komponenten) können Name und Rolle durch Software bestimmt werden; Zustände, Eigenschaften und Werte, die vom Benutzer festgelegt werden können, können durch Software festgelegt sein; und die Benachrichtigung über Änderungen an diesen Elementen steht den Benutzeragenten zur Verfügung, einschließlich assistierender Techniken.",
                            "level": "A",
                            "details": [
                                {
                                    "type": "note",
                                    "handle": "Anmerkung",
                                    "text": "Dieses Erfolgskriterium ist hauptsächlich für Webautoren gedacht, die ihre eigenen Bestandteile der Benutzerschnittstelle entwickeln oder skripten. Standard-HTML-Steuerelemente erfüllen zum Beispiel bereits dieses Erfolgskriterium, wenn sie entsprechend der Spezifikation benutzt werden."
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}